name: "MSCNN"
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "label_3_7x7"
  top: "label_4_5x5"
  top: "gt_boxes"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/DitM/window_files/mscnn_window_file_DitM_day_vehicle_train.txt"
    batch_size: 4
    coord_num: 4
    resize_width: 1280
    resize_height: 384
    crop_width: 512
    crop_height: 384
    min_gt_height: 25
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 40
    field_w: 56
    field_w: 80
    field_w: 112
    field_w: 160
    field_w: 224
    field_w: 320
    field_h: 40
    field_h: 56
    field_h: 80
    field_h: 112
    field_h: 160
    field_h: 224
    field_h: 320
    fg_threshold: 0.5
    do_multiple_scale: true
    min_scale: 40
    max_scale: 320
    shuffle: true
    output_gt_boxes: true
  }
}
layer {
  top: "data"
  top: "label_1_5x5"
  top: "label_1_7x7"
  top: "label_2_5x5"
  top: "label_2_7x7"
  top: "label_3_5x5"
  top: "label_3_7x7"
  top: "label_4_5x5"
  top: "gt_boxes"
  name: "data"
  type: "ImageGtData"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_gt_data_param {
    source: "../../../data/DitM/window_files/mscnn_window_file_DitM_day_vehicle_val.txt"
    batch_size: 2
    coord_num: 4
    resize_width: 1280
    resize_height: 384
    crop_width: 512
    crop_height: 384
    min_gt_height: 25
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_w: 40
    field_w: 56
    field_w: 80
    field_w: 112
    field_w: 160
    field_w: 224
    field_w: 320
    field_h: 40
    field_h: 56
    field_h: 80
    field_h: 112
    field_h: 160
    field_h: 224
    field_h: 320
    fg_threshold: 0.5
    do_multiple_scale: false
    shuffle: true
    output_gt_boxes: true
  }
}

###############
### LAYER 1 ###
###############

##    1_1    ##

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}

##    1_2    ##

layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

###############
### LAYER 2 ###
###############

##    2_1    ##

layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}

##    2_2    ##

layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

###############
### LAYER 3 ###
###############

##    3_1    ##

layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }  
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}

layer {
  bottom: "pool2"
  top: "conv3_1p"
  name: "conv3_1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1p"
  top: "conv3_1p"
  name: "relu3_1p"
  type: "ReLU"
}

##    3_2    ##

layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}

layer {
  bottom: "conv3_1"
  bottom: "conv3_1p"
  top: "conv3_2merge"
  name: "concat3_2"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv3_2merge"
  top: "conv3_2p"
  name: "conv3_2p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2p"
  top: "conv3_2p"
  name: "relu3_2p"
  type: "ReLU"
}

##    3_3    ##

layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "conv3_2"
  bottom: "conv3_2p"
  top: "conv3_3merge"
  name: "concat3_3"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv3_3merge"
  top: "conv3_3p"
  name: "conv3_3p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3p"
  top: "conv3_3p"
  name: "relu3_3p"
  type: "ReLU"
}
layer {
  bottom: "conv3_3p"
  top: "pool3p"
  name: "pool3p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

###############
### LAYER 4 ###
###############

##    4_1    ##

layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}

layer {
  bottom: "pool3"
  bottom: "pool3p"
  top: "conv4_1merge"
  name: "concat4_1"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv4_1merge"
  top: "conv4_1p"
  name: "conv4_1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1p"
  top: "conv4_1p"
  name: "relu4_1p"
  type: "ReLU"
}

##    4_2    ##

layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}

layer {
  bottom: "conv4_1"
  bottom: "conv4_1p"
  top: "conv4_2merge"
  name: "concat4_2"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv4_2merge"
  top: "conv4_2p"
  name: "conv4_2p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2p"
  top: "conv4_2p"
  name: "relu4_2p"
  type: "ReLU"
}

##    4_3    ##

layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}

layer {
  bottom: "conv4_2"
  bottom: "conv4_2p"
  top: "conv4_3merge"
  name: "concat4_3"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv4_3merge"
  top: "conv4_3p"
  name: "conv4_3p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3p"
  top: "conv4_3p"
  name: "relu4_3p"
  type: "ReLU"
}

###############
### LFCN 1  ###
###############

##   loss1_conv1   ##

layer {
  bottom: "conv4_3"
  top: "loss1_conv1"
  name: "loss1_conv1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "loss1_conv1"
  top: "loss1_conv1"
  name: "loss_relu1"
  type: "ReLU"
}

# loss1_conv1p
layer {
  bottom: "conv4_3"
  bottom: "conv4_3p"
  top: "concatLFCN_1"
  name: "concatLFCN_1"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "concatLFCN_1"
  top: "loss1_conv1p"
  name: "loss1_conv1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "loss1_conv1p"
  top: "loss1_conv1p"
  name: "loss_relu1p"
  type: "ReLU"
}



## LFCN_1_5x5 ##

layer {
  bottom: "loss1_conv1"
  bottom: "loss1_conv1p"
  top: "concat_loss1_conv1p"
  name: "concat_loss1_conv1p"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "concat_loss1_conv1p"
  top: "LFCN_1_5x5p"
  name: "LFCN_1_5x5p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
  }
}

# loss_1_5x5
layer {
  bottom: "LFCN_1_5x5p"
  bottom: "label_1_5x5"
  top: "loss_1_5x5"
  name: "detection_loss_1_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 40
    field_w: 40
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_5x5p"
  bottom: "label_1_5x5"
  top: "accuracy_1_5x5"
  top: "boxiou_1_5x5"
  name: "detection_accuracy_1_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 40
    field_w: 40
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}

## LFCN_1_7x7 ##

layer {
  bottom: "concat_loss1_conv1p"
  top: "LFCN_1_7x7p"
  name: "LFCN_1_7x7p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
  }
}

## Loss 1_7x7 ##
layer {
  bottom: "LFCN_1_7x7p"
  bottom: "label_1_7x7"
  top: "loss_1_7x7"
  name: "detection_loss_1_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 56
    field_w: 56
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
  loss_weight: 0.9
}
layer {
  bottom: "LFCN_1_7x7p"
  bottom: "label_1_7x7"
  top: "accuracy_1_7x7"
  top: "boxiou_1_7x7"
  name: "detection_accuracy_1_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 56
    field_w: 56
    field_whr: 2
    field_xyr: 2
    downsample_rate: 8
  }
}

##  POOL4  ##

layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "conv4_3p"
  top: "pool4p"
  name: "pool4p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

###############
### LAYER 5 ###
###############

##    5_1    ##

layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}

# 5_1p
layer {
  bottom: "pool4"
  bottom: "pool4p"
  top: "conv5_1merge"
  name: "concat5_1"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv5_1merge"
  top: "conv5_1p"
  name: "conv5_1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1p"
  top: "conv5_1p"
  name: "relu5_1p"
  type: "ReLU"
}

##    5_2    ##

layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}

# 5_2p
layer {
  bottom: "conv5_1"
  bottom: "conv5_1p"
  top: "conv5_2merge"
  name: "concat5_2"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv5_2merge"
  top: "conv5_2p"
  name: "conv5_2p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2p"
  top: "conv5_2p"
  name: "relu5_2p"
  type: "ReLU"
}

##    5_3    ##

layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}

# 5_3p
layer {
  bottom: "conv5_2"
  bottom: "conv5_2p"
  top: "conv5_3merge"
  name: "concat5_3"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv5_3merge"
  top: "conv5_3p"
  name: "conv5_3p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3p"
  top: "conv5_3p"
  name: "relu5_3p"
  type: "ReLU"
}

################
###  LFCN_2  ###
################

## LFCN_2_5x5 ##

layer {
  bottom: "conv5_3"
  bottom: "conv5_3p"
  top: "concatLFCN_2"
  name: "concatLFCN_2"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  bottom: "concatLFCN_2"
  top: "LFCN_2_5x5p"
  name: "LFCN_2_5x5p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}

## Loss_2_5x5 ##

layer {
  bottom: "LFCN_2_5x5p"
  bottom: "label_2_5x5"
  top: "loss_2_5x5"
  name: "detection_loss_2_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 80
    field_w: 80
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_5x5p"
  bottom: "label_2_5x5"
  top: "accuracy_2_5x5"
  top: "boxiou_2_5x5"
  name: "detection_accuracy_2_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 80
    field_w: 80
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}

## LFCN_2_7x7 ##

layer {
  bottom: "concatLFCN_2"
  top: "LFCN_2_7x7p"
  name: "LFCN_2_7x7p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}

## Loss_2_7x7 ##

layer {
  bottom: "LFCN_2_7x7p"
  bottom: "label_2_7x7"
  top: "loss_2_7x7"
  name: "detection_loss_2_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 112
    field_w: 112
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_2_7x7p"
  bottom: "label_2_7x7"
  top: "accuracy_2_7x7"
  top: "boxiou_2_7x7"
  name: "detection_accuracy_2_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 112
    field_w: 112
    field_whr: 2
    field_xyr: 2
    downsample_rate: 16
  }
}

##  POOL 5 ##

layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  bottom: "conv5_3p"
  top: "pool5p"
  name: "pool5p"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

###############
### LAYER 6 ###
###############

##    6_1    ##

layer {
  bottom: "pool5"
  top: "conv6_1"
  name: "conv6_1"
  type: "Convolution"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }

}
layer {
  bottom: "conv6_1"
  top: "conv6_1"
  name: "relu6_1"
  type: "ReLU"
}

# 6_1p
layer {
  bottom: "pool5"
  bottom: "pool5p"
  top: "conv6_1merge"
  name: "concat6_1"
  type: "Concat"
  concat_param {
    axis: 1
  }
}
layer {
  bottom: "conv6_1merge"
  top: "conv6_1p"
  name: "conv6_1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv6_1p"
  top: "conv6_1p"
  name: "relu6_1p"
  type: "ReLU"
}

################
###  LFCN 3  ###
################

## LFCN 3 5x5 ##

layer {
  bottom: "conv6_1"
  bottom: "conv6_1p"
  top: "concatLFCN_3"
  name: "concatLFCN_3"
  type: "Concat"
  concat_param {
    axis: 1
  }
}

layer {
  bottom: "concatLFCN_3"
  top: "LFCN_3_5x5p"
  name: "LFCN_3_5x5p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
  }
}

## Loss 3_5x5 ##

layer {
  bottom: "LFCN_3_5x5p"
  bottom: "label_3_5x5"
  top: "loss_3_5x5"
  name: "detection_loss_3_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 160
    field_w: 160
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_5x5p"
  bottom: "label_3_5x5"
  top: "accuracy_3_5x5"
  top: "boxiou_3_5x5"
  name: "detection_accuracy_3_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 160
    field_w: 160
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}

## LFCN 3_7x7 ##

layer {
  bottom: "concatLFCN_3"
  top: "LFCN_3_7x7p"
  name: "LFCN_3_7x7p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 3
    kernel_size: 7
  }
}

## Loss 3_7x7 ##

layer {
  bottom: "LFCN_3_7x7p"
  bottom: "label_3_7x7"
  top: "loss_3_7x7"
  name: "detection_loss_3_7x7"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 224
    field_w: 224
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_3_7x7p"
  bottom: "label_3_7x7"
  top: "accuracy_3_7x7"
  top: "boxiou_3_7x7"
  name: "detection_accuracy_3_7x7"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 224
    field_w: 224
    field_whr: 2
    field_xyr: 2
    downsample_rate: 32
  }
}

## POOL 6 ##

layer {
  bottom: "concatLFCN_3"
  top: "pool6"
  name: "pool6"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

################
###  LFCN 4  ###
################

## LFCN 4 5x5 ##

layer {
  bottom: "pool6"
  top: "LFCN_4_5x5p"
  name: "LFCN_4_5x5p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 9
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
    }
  }
}

## Loss 4_5x5 ##

layer {
  bottom: "LFCN_4_5x5p"
  bottom: "label_4_5x5"
  top: "loss_4_5x5"
  name: "detection_loss_4_5x5"
  type: "DetectionLoss"
  detection_loss_param {
    cls_num: 5
    coord_num: 4
    lambda: 1
    field_h: 320
    field_w: 320
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
    bb_smooth: true
    bg_threshold: 0.2
    bg_multiple: 2
    sample_mode: "bootstrap"
    pos_neg_weighted: true
  }
}
layer {
  bottom: "LFCN_4_5x5p"
  bottom: "label_4_5x5"
  top: "accuracy_4_5x5"
  top: "boxiou_4_5x5"
  name: "detection_accuracy_4_5x5"
  type: "DetectionAccuracy"
  detection_accuracy_param {
    cls_num: 5
    coord_num: 4
    field_h: 320
    field_w: 320
    field_whr: 2
    field_xyr: 2
    downsample_rate: 64
  }
}

#=================== proposal ======================
layer {
  bottom: "LFCN_1_5x5p"
  bottom: "LFCN_1_7x7p"
  bottom: "LFCN_2_5x5p"
  bottom: "LFCN_2_7x7p"
  bottom: "LFCN_3_5x5p"
  bottom: "LFCN_3_7x7p"
  bottom: "LFCN_4_5x5p"
  top: "proposals"
  name: "proposals"
  type: "BoxOutput"
  box_output_param {
    fg_thr: -10
    iou_thr: 0.65
    nms_type: "IOU"
    field_w: 40
    field_w: 56
    field_w: 80
    field_w: 112
    field_w: 160
    field_w: 224
    field_w: 320
    field_h: 40
    field_h: 56
    field_h: 80
    field_h: 112
    field_h: 160
    field_h: 224
    field_h: 320
    downsample_rate: 8
    downsample_rate: 8
    downsample_rate: 16
    downsample_rate: 16
    downsample_rate: 32
    downsample_rate: 32
    downsample_rate: 64
    field_whr: 2
    field_xyr: 2
    max_nms_num: 3000
  }
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
  propagate_down: 0
}
#=================== data preparation for detection subnet ======================
layer {
  bottom: "proposals"
  bottom: "gt_boxes"
  top: "rois"
  top: "proposal_labels"
  top: "proposal_targets"
  top: "box_inside_weights"
  top: "box_outside_weights"
  top: "match_gt_boxes"
  name: "proposal_info"
  type: "ProposalTarget"
  include {
    phase: TRAIN
  }
  proposal_target_param {
    cls_num: 5
    batch_size: 256
    fg_fraction: 0.25
    num_img_per_batch: 4
    fg_thr: 0.5
    bg_thr_hg: 0.49
    bg_thr_lw: 0.1
    img_width: 512
    img_height: 384
  }
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
  propagate_down: 0
  propagate_down: 0
}
layer {
  bottom: "proposals"
  bottom: "gt_boxes"
  top: "rois"
  top: "proposal_labels"
  top: "proposal_targets"
  top: "box_inside_weights"
  top: "box_outside_weights"
  top: "match_gt_boxes"
  name: "proposal_info"
  type: "ProposalTarget"
  include {
    phase: TEST
  }
  proposal_target_param {
    cls_num: 5
    batch_size: 128
    fg_fraction: 0.25
    num_img_per_batch: 2
    fg_thr: 0.5
    bg_thr_hg: 0.49
    bg_thr_lw: 0.1
    img_width: 512
    img_height: 384
  }
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
  propagate_down: 0
  propagate_down: 0
}
#=================== detection subnet ======================
layer {
  name: "roi_pool_org"
  type: "ROIPooling"
  bottom: "concatLFCN_1"
  bottom: "rois"
  top: "roi_pool_org"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.125 # 1/8
    pad_ratio: 0
  }
}
layer {
  name: "roi_pool_ctx"
  type: "ROIPooling"
  bottom: "concatLFCN_1"
  bottom: "rois"
  top: "roi_pool_ctx"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.125 # 1/8
    pad_ratio: 0.25
  }
}
layer {
  name: "roi_pool"
  type: "Concat"
  bottom: "roi_pool_org"
  bottom: "roi_pool_ctx"
  top: "roi_pool"
}

## ROI c1p ##

layer {
  bottom: "roi_pool"
  top: "roi_c1p"
  name: "roi_c1p"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    kernel_size: 3
    #pad: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  bottom: "roi_c1p"
  top: "roi_c1p"
  name: "roi_c1p_relu"
  type: "ReLU"
}

## FC6p ##

layer {
  name: "fc6p"
  type: "InnerProduct"
  bottom: "roi_c1p"
  top: "fc6p"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6p"
  type: "ReLU"
  bottom: "fc6p"
  top: "fc6p"
}
layer {
  name: "drop6p"
  type: "Dropout"
  bottom: "fc6p"
  top: "fc6p"
  dropout_param {
    dropout_ratio: 0.5
  }
}

## CLS PREDP ##

layer {
  name: "cls_predp"
  type: "InnerProduct"
  bottom: "fc6p"
  top: "cls_predp"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

## BBOX Predp ##

layer {
  name: "bbox_predp"
  type: "InnerProduct"
  bottom: "fc6p"
  top: "bbox_predp"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

## Final losses ##

layer {
  bottom: "cls_predp"
  bottom: "proposal_labels"
  top: "loss_cls"
  name: "loss_cls"
  type: "SoftmaxWithLoss"
  loss_weight: 1
  propagate_down: 1
  propagate_down: 0
}
layer {
  name: "cls_accuracy"
  type: "Accuracy"
  bottom: "cls_predp"
  bottom: "proposal_labels"
  top: "cls_accuracy"
}
layer {
  name: "loss_bbox"
  type: "SmoothL1Loss"
  bottom: "bbox_predp"
  bottom: "proposal_targets"
  bottom: "box_inside_weights"
  bottom: "box_outside_weights"
  top: "loss_bbox"
  loss_weight: 1
}
layer {
  name: "bbox_iou"
  type: "BboxAccuracy"
  bottom: "bbox_predp"
  bottom: "rois"
  bottom: "match_gt_boxes"
  top: "bbox_iou"
  top: "bbox_iou_pre"
  bbox_reg_param {
    bbox_mean: 0 bbox_mean: 0 bbox_mean: 0 bbox_mean: 0
    bbox_std: 0.1 bbox_std: 0.1 bbox_std: 0.2 bbox_std: 0.2
  }
}
